app/controllers/store_controller.rb

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-04-17 01:49:42', 5, 3, 1, 93.78, '2011-04-17 01:49:42')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Derek Tia', '900 Van Ness Ave.