app/controllers/twitterfeeds_controller.rb

  def index
    Twitterfeed.destroy_all
---
DELETE FROM "twitterfeeds" WHERE "id" = 335

  def show
    @twitterfeed = Twitterfeed.find(params[:id])
---
SELECT * FROM "twitterfeeds" WHERE ("twitterfeeds"."id" = 0)

  def edit
    @twitterfeed = Twitterfeed.find(params[:id])
---
SELECT * FROM "twitterfeeds" WHERE ("twitterfeeds"."id" = 1)

  def create
    @twitterfeed = Twitterfeed.new(params[:twitterfeed])

    respond_to do |format|
      if @twitterfeed.save
---
INSERT INTO "twitterfeeds" ("created_at", "updated_at", "text", "user") VALUES('2011-05-01 21:09:08', '2011-05-01 21:09:08', 'blah blah blah', 'gaga')

  def destroy
    @twitterfeed = Twitterfeed.find(params[:id])
    @twitterfeed.destroy
---
SELECT * FROM "twitterfeeds" WHERE ("twitterfeeds"."id" = 1)
DELETE FROM "twitterfeeds" WHERE "id" = 1